var dataList = [
  {
    "id": 1,
    "imgUrl": "https://upload-images.jianshu.io/upload_images/11158618-79bd9cdda295e0eb.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/768/format/webp",
    "title": "我想给你们介绍一个与众不同的微信公众号",
    "leassonType": 1,
    "html": "<h2>前言</h2><div></div><ul><li>今天，我想向广大网友介绍一个与众不同、有特色的微信公众号，希望你们会喜欢。</li></ul><ul><li>注：我是本：达叔与他的朋友们，微信公众号的运营者 达叔小生</ul><p>是一个热爱生活和工作的侠客！阅读他的文章，会上瘾！You and me, we are family !</p><p>附：各大技术社区的个人链接</p><ul><li><p>个人博客 =&gt;🙈：http://huangguangda.cn/</a></p></li><li><p>CSDN：https://blog.csdn.net/qq_36232611</a></p></li><li><p>简书：https://www.jianshu.com/u/c785ece603d1</a></p></li><li><p>稀土掘金：https://juejin.im/user/5a16e1f3f265da43128096cb</a></p></li></ul><h2>1. 初衷</h2><ul><li>背景：记录会让记忆更加深刻，遇到同样的问题再次发生时，可以第一时间寻找到答案；</li><li>探索：寻找公众号的运营方式，找到一起努力坚持的小伙伴，志同道合的朋友；</li><li>憧憬：满足用户需求，拥有个人特色的公众号</li></ul><hr><h2>2. 公众号基本介绍</h2><ul><li>名称：达叔与他的朋友们</li><li>微信号：dashucoding</li><li>Logo：小女孩</li><li>寓意：性格可爱，乐观，阳光</li></ul><h2>总结</h2><li><p>在记录过程和答案的同时也进行着复习，并且可能会产生一些扩散思维，收集到更多相关知识。把博客分享出来，更是对自己所掌握知识的补充，这就是这个博客诞生的原因。</p></li>",
    "time":"2016-09-20"
  },
  {
    "id": 2,
    "imgUrl": "https://upload-images.jianshu.io/upload_images/11158618-b12614a519a5212a.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/768/format/webp",
    "title": "Vue的使用你学会了吗？",
    "leassonType": 2,
    "html": "<p>今儿跟大家聊聊 Vue 。</p>不得不承认， Vue 越来越受欢迎了。对比 Angular 和 React，虽然三者都是非常优秀的前端框架，但从 GitHub 趋势看，Vue 已经排在第一位，达到了13万的 Star。<p>放眼国内外，不管是 BAT 等大厂，还是创业公司，Vue 都有广泛的应用。面试的时候，Vue 相关技术原理也一定是必考点。可以说，对于任何一个前端工程师来说，掌握 Vue 可能不是一个可选项，而更像一门“必修课”。</p>",
    "time": "2017-12-27"
  },
  {
    "id": 3,
    "imgUrl": "https://upload-images.jianshu.io/upload_images/11158618-ecdccb5083c36495.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/768/format/webp",
    "title": "微信小程序基础",
    "leassonType": 3,
    "html": "<p>微信小程序介绍</p><p>微信小程序开发工具的使用</p><p>微信小程序框架文件</p><p>微信小程序逻辑层</p><p>微信小程序视图层</p><p>微信小程序组件介绍</p><p>微信小程序API说明</p><p>小程序是一种不需要下载安装即可使用的应用，它实现了应用“触手可及”的梦想，用户扫一扫或者搜一下即可打开应用。也体现了“用完即走”的理念，用户不关心是否安装太多应用的问题。应用将无处不在，随时随地可用，但又无需安装卸载。</p>",
    "time": "2018-06-20"
  },
]
var bannerList = [   
    'https://upload-images.jianshu.io/upload_images/11158618-79bd9cdda295e0eb.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/768/format/webp',
    'https://upload-images.jianshu.io/upload_images/11158618-b12614a519a5212a.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/768/format/webp',
    'https://upload-images.jianshu.io/upload_images/11158618-ecdccb5083c36495.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/768/format/webp'
  ]
// 定义数据出口
module.exports = {
  detailList: dataList,
  bannerList: bannerList
}